app/controllers/books_controller.rb

INSERT INTO "books" ("title", "author", "price", "published_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Test Book"], ["author", "Me"], ["price", "10.0"], ["published_date", "2025-09-16"], ["created_at", "2025-09-16 01:41:11.735681"], ["updated_at", "2025-09-16 01:41:11.735681"]]
---
  def create
    @book = Book.new(book_params)
    if @book.save

SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "books" SET "price" = $1, "published_date" = $2, "updated_at" = $3 WHERE "books"."id" = $4  [["price", "5.01"], ["published_date", "2022-09-09"], ["updated_at", "2025-09-09 18:48:31.901543"], ["id", 4]]
---
  def update
    @book = Book.find(params[:id])
    if @book.update(book_params)