app/controllers/user_books_controller.rb

SELECT "user_books".* FROM "user_books"
---
  def index
    @user_books = UserBook.all

SELECT "user_books".* FROM "user_books" WHERE "user_books"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @user_book = UserBook.find(params[:id])

SELECT "user_books".* FROM "user_books" WHERE "user_books"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def edit
    @user_book = UserBook.find(params[:id])

INSERT INTO "user_books" ("user_id", "book_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 3], ["book_id", 6], ["created_at", "2025-09-16 02:01:13.935246"], ["updated_at", "2025-09-16 02:01:13.935246"]]
---
  def create
    @user_book = UserBook.new(user_book_params)

    respond_to do |format|
      if @user_book.save

DELETE FROM "user_books" WHERE "user_books"."id" = $1  [["id", 1]]
---
  def destroy
    @user_book.destroy

SELECT "user_books".* FROM "user_books" WHERE "user_books"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_user_book
      @user_book = UserBook.find(params[:id])